<?php
    //課題1

    //ビンゴシート作成
    for($i = 0; $i < 3; $i++){
        for($j = 0; $j < 3; $j++){
            $A[$i][$j] = readline('ビンゴシートを入力してください:');
        }
    }

    //何回玉を引くか
    $N = readline('何回実行するか入力してください:');

    //ビンゴの数字
    for($n = 0; $n < $N; $n++){
        $b[$n] = readline('ビンゴの数字を選んでください:');
    }

    //ビンゴカードに存在するかチェック
    for($i = 0; $i < 3; $i++){
        for($j = 0; $j < 3; $j++){
            for($n = 0; $n < $N; $n++){
                if($A[$i][$j] == $b[$n])$A[$i][$j] = '○';
            }
        }
    }

    $bingo = 'NO';
    //横ビンゴ,縦ビンゴ
    for($i = 0; $i < 3; $i++){
        if($A[$i][0] == '○' && $A[$i][1] == '○' && $A[$i][2] == '○') $bingo = "YES";
        if($A[0][$i] == '○' && $A[1][$i] == '○' && $A[2][$i] == '○') $bingo = "YES";
    }

    //斜めビンゴ
    if($A[0][0] == '○' && $A[1][1] == '○' && $A[2][2] == '○') $bingo = "YES";
    if($A[0][2] == '○' && $A[1][1] == '○' && $A[2][0] == '○') $bingo = "YES";

    echo $bingo;
?>